---
kind: method
id: M:Autodesk.Revit.DB.Electrical.PanelScheduleTemplate.SetTableData(Autodesk.Revit.DB.Electrical.PanelScheduleData)
source: html/130f4d8a-fdbf-f00c-7f6f-6638fe37c48b.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleTemplate.SetTableData Method

Assigns table data to this template

## Syntax (C#)
```csharp
public void SetTableData(
	PanelScheduleData Data
)
```

## Parameters
- **Data** (`Autodesk.Revit.DB.Electrical.PanelScheduleData`) - The panel schedule data

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null